## Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

weekday = input('Input number of weekday: ')
if weekday == '6':
    print('It is weekend!!')
elif weekday == '7':
    print('It is weekend!!')
else:
    print('It is wrong day to relax')